let handler = async (m, { command, text }) => m.reply(`*💥❯══⊹⊱≼ مرحبا بك ≽⊰⊹══❮💥*
*❮ حط رمز قبل قسم حاجه من 👈  ( / . )❮*

*❮ اذا عندك طلب او اي شي تريد تقوله للمطور اكتب (.تقرير وحط طلبك)❮*

*❆❯══⊹⊱≼ 🥇 ≽⊰⊹══❮❆*
*『 ️🥇 』⇦ قسم الترفيه ╿↶*
*❆❯══⊹⊱≼ 🥇 ≽⊰⊹══❮❆*

*🎮┣.اكس*
❍↜يشغل لعبه XO

*🎮┣.لعبه*
❍↜يشغل لعبه حجر ورقه مقص 

*🎮┣.فعاليات*
❍↜بيجبلك فعاليات تلقائي 

*🎮┣.لو*
❍↜لو خيروك 

*🎮┣.سؤال*
❍↜اسئله انمي صعبه 

*🎮┣.سؤ*
❍↜اسئله دينية 

*🎮┣.اسئلني*
❍↜البوت يسألك أسأله عشوائيه 

*🎮┣.الحب*
❍↜يقيس نسبه الحب اليك 

*🎮┣.بيحبني*
❍↜يمنشن اللي بيحبك 

*🎮┣.علم*
❍↜يجيب لك علم دوله وانت اكتب اسمها

*🎮┣.رياضيات*
❍↜ييجيب لك مسئله رياضيات

*🎮┣.احزر*
❍↜احزر اسم الشخصيه

*🎮┣.عكس*
❍↜ييجيب لك كلمه وانت اعكسها

*🎮┣.نصيحه*
❍↜ييجيب لك نصيحه

*🎮┣.نرد*
❍↜يجيب لك ملصق نرد متحرك

*🎮┣.رابطي*
❍↜ييجيب لك رابطك

*🎮┣.الكره*
❍↜يقيس نسبه الكره لك 

*🎮┣.بيكرهني*
❍↜يمنشن اللي بيكرهك

*🎮┣.زوجني*
❍↜يجيب لك صوره و بيقولك دي زوجتك/زوجك

*🎮┣.هل*
❍↜اكتب سؤال و بيجاوب عليه عشوائي

*🎮┣.صراحه*
❍↜بيجيب لك اسئله عشوائيه

*🎮┣.مقارنه*
❍↜يعمل مقارنه بين شخصيات الانمي

*🎮┣.خمن*
❍↜بيخليك تخمن اسم شخصية انمي

*🎮┣.تفكيك*
❍↜بيجيب لك كلمه و انت فككها

*🎮┣.رتب*
❍↜بيجيب لك كلمه و انت رتبها

*🎮┣.متفجرات*
❍↜بيجيب لك لعبه الصندوق و القنبله

*🎮┣.غباء*
❍↜يقيس نسبه الغباء

*🎮┣.ذكاء*
❍↜يقيس نسبه الذكاء 

*🎮┣.زواج*
❍↜يجوز اتنين من الجروب

*🎮┣.طلاق*
❍↜يطلق اتنين من الجروب

*🎮┣.قتل*
❍↜يمنشن على اتنين من الجروب

*🎮┣.صفع*
❍↜بيجيب ملصق صفع

*🎮┣.ركل*
❍↜بيجيب ملصق بيركل

*🎮┣.يبكي*
❍↜بيجيب ملصق يبكي

*🎮┣.طبطبه*
❍↜بيجيب ملصق بيطبطب

*🎮┣كت*
❍↜اسماء شخصيات انمي عشوائية 

*🎮┣.كت2*
❍↜مسابقه اسماء شخصيات انمي عشوائيه 

*🎮┣delttt* 
❍↜حذف غرفه اكس او 

*🎮┣شبهي* 
❍↜بيختار شخص عشوائي شبهك

*🎮┣جمال*
❍↜بيختار شخص عشوائي جميل

*🎮┣تاج* 
❍↜لعبه الصراحه`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['الاوامر <teks>?']
handler.tags = ['الاوامر', 'fun']
handler.command = /^(قسم الترفيه|قسم-الترفيه|قسم-الترفية)$/i

export default handler
